%%  二维 
clear all;clc; close all;
%% 初始化
tf = 500; %时刻
Q = diag(ones(4, 1) * 0.001);%预测噪声协方差矩阵Q：假设预测过程上叠加一个高斯噪声，协方差矩阵为Q
R = diag(ones(2, 1) * 0.02);%观测噪声协方差矩阵R：假设观测过程上存在一个高斯噪声，协方差矩阵为R
P =eye(4);
X=zeros(4,tf);    %X表示目标现在的实际状态X=[X,Y,V,THETA]
Xnew=zeros(4,tf); %Xnew表示目标状态的后验估计值

X(:,1)=[1;7;1;pi/4]; %按照y=2x+5初始化  X,Y,V,THETA
Xnew(:,1)=X(:,1);

Z=zeros(2,tf);    %Z表示测得的量测值Z=[f(X,V),f(Y,theta)]

Z(:,1)=[1;7];
z_=zeros(2,tf);
z_(:,1)=Z(:,1);   %z_表示预测的量测，即从估计的状态转换过来的量测

%%
for k = 2 : tf 
    %% %%%%%%%%%%%%%%%%模拟系统%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    w=sqrt(0.001)*randn(4,tf);%模拟航行器在水下航行受到的扰动
    X(:,k) =[X(1,k-1)+X(3,k-1)*cos(X(4,k-1));X(2,k-1)+X(3,k-1)*sin(X(4,k-1));X(3,k-1);X(4,k-1)]+w(:,k);
    v=sqrt(0.02)*randn(2,tf);%模拟量测在测量中受到的扰动
    Z(:,k) =[X(1,k)^2/10+X(3,k);X(2,k)+X(4,k)]++v(:,k);%模拟的测得的量测 
    
    %% %%%%%%%%%%%%%%%%EKF开始%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    Xpre =[Xnew(1,k-1)+X(3,k-1)*cos(Xnew(4,k-1));Xnew(2,k-1)+Xnew(3,k-1)*sin(Xnew(4,k-1));Xnew(3,k-1);Xnew(4,k-1)]; %先验估计，即预测值
    A=[1,0,cos(Xnew(4,k-1)),-Xnew(3,k-1)*sin(Xnew(4,k));0,1,-sin(Xnew(4,k-1)),Xnew(3,k-1)*cos(Xnew(4,k));0,0,1,0;0,0,0,1];%状态转移矩阵，xk对xk-1求导
    H =[Xpre(1)/5,0,1,0;0,1,0,1];%量测矩阵
    z_ =[Xpre(1)^2/10+Xpre(3);Xpre(2)+Xpre(4)];          %预测的量测    
    PP=A*P*A'+Q;         %先验估计协方差矩阵
    Kk=PP*H'*inv(H*PP*H'+R);       %卡尔曼增益
    Xnew(:,k)=Xpre+Kk*(Z(:,k)-z_); %后验估计
    P=PP-Kk*H*PP;                  %后验估计误差协方差矩阵
end
t = 2 : tf;
figure;
plot(X(1,t),X(2,t),'b',Xnew(1,t),Xnew(2,t),'r--');
xlabel('x位置');ylabel('y位置');
legend('真实值','KF估计值');


